Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh3808-v3.tmx
Source language: bo
Languages: en

source: ལྷའི་དབང་པོའི་སྒྲ་དབྱངས་ལྟར་སྙན་པ་དང་། རྔའི་སྒྲ་དང་། མ་ཁེངས་པ་དང་། མི་དམའ་བ་དང་། སྒྲ་དབྱངས་ཐམས་ཅད་ཀྱི་རྗེས་སུ་ཞུགས་པ་དང་། ཚིག་ཟུར་ཆག་མེད་པ་དང་། མ་ཚང་བ་མེད་པ་དང་། མ་ཞུམ་པ་དང་། མི་ཞན་པ་དང་། རབ་ཏུ་དགའ་བ་དང་། ཁྱབ་པ་དང་། ཆུབ་པ་དང་། རྒྱུན་ཆགས་པ་དང་། འབྲེལ་པ་དང་། སྒྲ་ཐམས་ཅད་རྫོགས་པར་བྱེད་པ་དང་། དབང་པོ་ཐམས་ཅད་ཚིམ་པར་བྱེད་པ་དང་། མ་སྨད་པ་དང་། མི་འགྱུར་བ་དང་། མ་བརྟབས་པ་དང་། འཁོར་ཀུན་ཏུ་གྲགས་པ་དང་། རྣམ་པ་ཐམས་ཅད་ཀྱི་མཆོག་དང་ལྡན་པ་ཞེས་གསུངས་པ་ལྟ་བུའོ། །དེ་ལ་གཉེན་པོ་ནི་ཁམས་དང་། དགེ་བའི་རྩ་བ་ཐམས་ཅད་ཉེ་བར་སྟོན་པའི་ཕྱིར་རོ། །འཇམ་པ་ནི་ཚེ་འདི་ཉིད་ལ་བདེ་བ་ལ་རེག་པར་བྱེད་པའི་ཕྱིར་རོ། །ཡིད་དུ་འོང་བ་ནི་དོན་བཟང་པོའི་ཕྱིར་རོ། །ཡིད་དུ་འཐད་པ་ནི་ཚིག་འབྲུ་བཟང་པོའི་ཕྱིར་རོ། །དག་པ་ནི་འཇིག་རྟེན་ལས་འདས་པ་བླ་ན་མེད་པའི་རྗེས་ལ་བྱུང་བའི་ཕྱིར་རོ། །དྲི་མ་མེད་པ་ནི་ཉོན་མོངས་པའི་བག་ལ་ཉལ་དང་། བག་ཆགས་ཐམས་ཅད་དང་བྲལ་བའི་ཕྱིར་རོ། །གསལ་བ་ནི་ཚིག་དང་ཡི་གེ་གྲགས་པའི་ཕྱིར་རོ། །སྙན་ཅིང་འཇེབས་པ་ནི་མུ་སྟེགས་ཅན་ཐམས་ཅད་ཀྱི་ལོག་པའི་བློ་གྲོས་དང་། ལྟ་བ་འཇིག་པའི་ཡོན་ཏན་དང་ལྡན་པའི་ཕྱིར་རོ། །མཉན་པར་འོས་པ་ནི་སྒྲུབ་པས་ངེས་པར་འབྱིན་པའི་ཕྱིར་རོ། །མི་ཚུགས་པ་ནི་ཕས་ཀྱི་རྒོལ་བ་ཐམས་ཅད་ཀྱིས་བར་མི་ཆོད་པའི་ཕྱིར་རོ། །སྙན་པ་ནི་དགའ་བར་བྱེད་པའི་ཕྱིར་རོ། །དུལ་བ་ནི་འདོད་ཆགས་ཀྱི་གཉེན་པོར་གྱུར་པའི་ཕྱིར་རོ། །མི་རྩུབ་པ་ནི་བསླབ་པ་བཅས་པ་ཐབས་སླ་བའི་ཕྱིར་རོ། །མི་བརླང་བ་ནི་དེ་ལས་འདས་པ་དག་ཡང་དག་པར་འབྱུང་བ་སྟོན་པར་བྱེད་པའི་ཕྱིར་རོ། །རབ་ཏུ་དུལ་བ་ནི་ཐེག་པ་གསུམ་གྱིས་འདུལ་བ་སྟོན་པའི་ཕྱིར་རོ། །རྣར་སྙན་པ་ནི་གཡེང་བའི་གཉེན་པོར་གྱུར་པའི་ཕྱིར་རོ། །ལུས་སིམ་པར་བྱེད་པ་ནི་ཏིང་ངེ་འཛིན་ཐོབ་པར་བྱེད་པའི་ཕྱིར་རོ།
en: There, it is the “voice with sixty special qualities” because, as Secrets of the Tathāgatas Sūtra says, it is moist, pleasant, charming, captivating, pure, immaculate, clearly illuminating, modulated, worth listening to, impervious, low and sweet in tone, subdued, not harsh, not violent, tamed, pleasing to the ear, physically refreshing, mentally exciting, satisfying to the heart, a producer of joy and happiness, without an edge, worth fully understanding, worth reflecting on, clear, worth loving, worth delighting in, worth making fully known, worth causing reflection, logical, relevant, without repetition, a lion’s roar, an elephant’s bellow, a peal of thunder, a dragon lord’s speech, the music of the celestials, the sound of the cry of the cuckoo, the sound of the voice of Brahmā, the sound of the cry of the jīvaṃjīvaka, the mellifluous voice of the lord of gods, the beat of a drum, not overblown, not understated, with every word syntactically correct, free of wrong usage, not wanting, not base, not miserable, joyful, comprehensive, comprehension, fluent, playful, and it completes all sounds, satisfies all senses, is blameless, does not waver, is not too quick, carries over the entire assembly, and is completely endowed with excellence.

source: །སེམས་ཚིམ་པར་བྱེད་པ་ནི་ལྷག་མཐོང་གིས་མཆོག་ཏུ་དགའ་བ་ཐོབ་པར་བྱེད་པའི་ཕྱིར་རོ། །སྙིང་དགའ་བར་བྱེད་པ་ནི་ཐེ་ཚོམ་གཅོད་པའི་ཕྱིར་རོ། །དགའ་བདེ་བསྐྱེད་པ་ནི་ལོག་པར་ངེས་པ་སེལ་བའི་ཕྱིར་རོ། །ཡོངས་སུ་གདུང་བ་མེད་པ་ནི་བསྒྲུབ་པ་ལ་འགྱོད་པ་མེད་པའི་ཕྱིར་རོ། །ཀུན་དུ་ཤེས་པར་བྱ་བ་ནི་ཐོས་པ་ལས་བྱུང་བའི་ཤེས་པ་ཕུན་སུམ་ཚོགས་པའི་གཞིར་གྱུར་པའི་ཕྱིར་རོ། །རྣམ་པར་རིག་པར་བྱ་བ་ནི་བསམས་པ་ལས་བྱུང་བའི་ཤེས་པ་ཕུན་སུམ་ཚོགས་པའི་གཞིར་གྱུར་པའི་ཕྱིར་རོ། །རྣམ་པར་གསལ་བ་ནི་སློབ་དཔོན་གྱི་ཆོས་ཀྱི་དཔེ་མཁྱུད་མེད་པ་ལས་བྱུང་བའི་ཕྱིར་རོ། །དགའ་བར་བྱེད་པ་ནི་བདག་གི་དོན་རྗེས་སུ་ཐོབ་པ་རྣམས་དགའ་བར་བྱེད་པའི་ཕྱིར་རོ། །མངོན་པར་དགའ་བར་བྱེད་པ་ནི་བདག་གི་དོན་མ་ཐོབ་པ་རྣམས་རེ་བར་བྱེད་པའི་ཕྱིར་རོ། །ཀུན་ཤེས་པར་བྱེད་པ་ནི་བསམ་གྱིས་མི་ཁྱབ་པའི་ཆོས་ཡང་དག་པར་སྟོན་པའི་ཕྱིར་རོ།
en: It is (1) “moist” because it firms up the wholesome roots of the mass of beings; (2) “pleasant” because it is a joy to contact in the here and now; (3) “charming” because it is about goodness; (4) “captivating” because of clear articulation; (5) “pure” because it is the unsurpassed, extraordinary subsequent attainment; (6) “immaculate” because it is free from all afflictions, bad proclivities, and residual impressions; (7) “clearly illuminating” because the words and syllables are heard; (8) “modulated” (valgu) because it has the quality of strength (balaguṇa) to overcome all ill-thought-out tīrthika prejudice; (9) “worth listening to” because it comes forth from practice; (10) “impervious” because it is not stymied by anybody else’s arguments; (11) “low and sweet in tone” because it is stimulating; (12) “subdued” because it counteracts attachment; (13) “not harsh” because it gently imparts training; (14) “not violent” because it teaches transcending that is perfect renunciation; (15) “tamed” because it teaches the discipline of the three vehicles; (16) “pleasing to the ear” because it counteracts distraction; (17) “physically refreshing” because it makes you collect your thoughts; (18) “mentally exciting” because it carries with it the joyfulness of special insight; (19) “satisfying to the heart” because it gets rid of doubt; (20) “a producer of joy and happiness” because it removes mistakes and uncertainty; (21) “without an edge” because it does not make you feel sorry when you practice; (22) “worth fully understanding” because it is a basis for perfect knowledge arisen from listening; (23) “worth reflecting on” because it is a basis for perfect knowledge arisen from thinking; (24) “clear” because it is not a Dharma set forth by a tight-fisted teacher; (25) “worth loving” because it makes those who have reached their own goal love it; (26) “worth delighting in” because it makes those who have not reached their own goal delight in it; (27) “worth making fully known” because it makes the inconceivable dharmas perfectly visible; (28) “worth causing reflection” because it perfectly teaches the inconceivable dharmas; (29) “logical” because it does not contradict valid cognition; (30) “relevant” because it teaches trainees what they seek; (31) “without repetition” because it is not to no avail; (32) “a lion’s roar” because of frightening all the tīrthika communities; (33) “an elephant’s trumpeting” because it is a clear and high sound; (34) “a peal of thunder” because it is deep; (35) “a dragon lord’s speech” because it is worth keeping; (36) “the music of the celestials” because it is sweet; (37) “the sound of the cry of the cuckoo” because it naturally happens quickly; (38) “the sound of the voice of Brahmā” because it carries far; (39) “the sound of the cry of the jīvaṃjīvaka” because it is an auspicious omen preceding all spiritual achievement; (40) “the mellifluous voice of the lord of gods” because it is not something you transgress; (41) “the beat of a drum” because it precedes victory over all Māras and opponents; (42) “not overblown” because it is not praise that spoils; (43) “not understated” because it is not censure that spoils; (44) “with every word syntactically correct” because it follows in every respect the rules in all the grammars; (45) “free of wrong usage” because a lack of mindfulness does not occasion it; (46) “not wanting” because at all times it serves the needs of disciples; (47) “not base” because it is not contingent on gifts and services; (48) “not miserable” because it is fearless; (49) “joyful” because happiness has come from it; (50) “comprehensive” because expertise in all areas of knowledge comes from it; (51) “comprehension” because it accomplishes all the needs of living beings; (52) “fluent” because it is without hiatuses; (53) “playful” because it comes in various figurations; (54) and it “completes all sounds” because one sound serves to represent different words in different languages; (55) “satisfies all senses” because one object serves to represent different objects; (56) “is blameless” because it is done in accord with the commitment; (57) “does not waver” because it is connected with future time; (58) is “not too quick” because it is unrushed; (59) “carries over the entire assembly” because those far and near in the assembly can hear it equally; and (60) is “completely endowed with excellence” because it is the thorough establishment of all ordinary meaning and example dharmas.

source: །རྣམ་པར་རིག་པར་བྱེད་པ་ནི་བསམ་དུ་ཡོད་པའི་ཆོས་ཡང་དག་པར་སྟོན་པའི་ཕྱིར་རོ། །རིགས་པ་ནི་ཚད་མ་དང་མི་འགལ་བའི་ཕྱིར་རོ། །འབྲེལ་བ་ནི་ཅི་རིགས་པར་འདུལ་བ་ལ་སྟོན་པའི་ཕྱིར་རོ། །ཟློས་པའི་སྐྱོན་མེད་པ་ནི་དོན་མེད་པ་མ་ཡིན་པའི་ཕྱིར་རོ། །སེང་གེའི་སྒྲའི་ཤུགས་ནི་མུ་སྟེགས་ཅན་གྱི་ཚོགས་ཐམས་ཅད་སྐྲག་པར་བྱེད་པའི་ཕྱིར་རོ། །གླང་པོ་ཆེའི་སྒྲ་སྐད་ནི་སྒྲ་གསང་མཐོ་བའི་ཕྱིར་རོ། །འབྲུག་གི་སྒྲ་དབྱངས་ནི་ཟབ་པའི་ཕྱིར་རོ། །ཀླུའི་དབང་པོའི་སྒྲ་ནི་གཟུང་བར་འོས་པའི་ཕྱིར་རོ། །དྲི་ཟའི་གླུ་དབྱངས་ནི་སྙན་པའི་ཕྱིར་རོ། །བྱ་ཀ་ལ་པིང་ཀའི་སྒྲ་དབྱངས་བསྒྲགས་པ་ནི་མྱུར་དུ་འགྱུར་བའི་ངང་ཚུལ་ཅན་གྱི་ཕྱིར་རོ། །ཚངས་པའི་སྒྲ་དབྱངས་བསྒྲགས་པ་ནི་རྒྱང་རིང་དུ་གྲགས་པའི་ཕྱིར་རོ། །ཤང་ཤང་ཏེའུའི་སྒྲ་དབྱངས་སུ་གྲགས་པ་ནི་ཐམས་ཅད་དུ་གྲུབ་པ་ཐོག་མར་འགྲོ་བའི་བཀྲ་ཤིས་ཡིན་པའི་ཕྱིར་རོ། །ལྷའི་དབང་པོའི་དབྱངས་ལྟར་སྙན་པ་ནི་འགལ་བར་བྱ་བ་མ་ཡིན་པའི་ཕྱིར་རོ། །རྔའི་སྒྲ་ནི་བདུད་ཕྱིར་རྒོལ་བ་ཐམས་ཅད་ཕམ་པར་བྱ་བ་ལ་ཐོག་མར་འགྲོ་བའི་ཕྱིར་རོ། །མ་ཁེངས་པ་ནི་བསྟོད་པས་ཀུན་ནས་ཉོན་མོངས་པ་མེད་པའི་ཕྱིར་རོ། །མི་དམའ་བ་ནི་སྨད་པས་ཀུན་ནས་ཉོན་མོངས་པ་མེད་པའི་ཕྱིར་རོ། །སྒྲ་ཐམས་ཅད་ཀྱི་རྗེས་སུ་ཞུགས་པ་ནི་རྣམ་པར་བསྒྲུབ་པ་ཐམས་ཅད་དང་། མཚན་ཉིད་རྣམ་པ་ཐམས་ཅད་ཀྱི་རྗེས་སུ་ཞུགས་པའི་ཕྱིར་རོ། །ཚིག་ཟུར་ཆག་མེད་པ་ནི་བརྗེད་པར་དེ་མི་འབྱིན་པའི་ཕྱིར་རོ། །མ་ཚང་བ་མེད་པ་ནི་འདུལ་བའི་བྱ་བ་ལ་དུས་ཐམས་ཅད་དུ་ཉེ་བར་གནས་པའི་ཕྱིར་རོ། །མ་ཞུམ་པ་ནི་རྙེད་པ་དང་བཀུར་སྟི་ལ་མི་རྟག་པའི་ཕྱིར་རོ། །མི་ཞན་པ་ནི་འཇིགས་པ་མེད་པའི་ཕྱིར་རོ། །རབ་ཏུ་དགའ་བ་ནི་བདེ་བ་བྱུང་བའི་ཕྱིར་རོ། །ཁྱབ་པ་ནི་རིག་པའི་གནས་ཐམས་ཅད་ལ་མཁས་པའི་རྗེས་སུ་ཞུགས་པའི་ཕྱིར་རོ། །ཆུབ་པ་ནི་སེམས་ཅན་རྣམས་ཀྱི་དོན་མཐའ་དག་སྒྲུབ་པར་བྱེད་པའི་ཕྱིར་རོ། །རྒྱུན་ཆགས་པ་ནི་རྒྱུན་མི་འཆད་པའི་ཕྱིར་རོ། །འབྲེལ་པ་ནི་རྣམ་པ་སྣ་ཚོགས་སུ་གནས་པའི་ཕྱིར་རོ། །སྒྲ་ཐམས་ཅད་རྫོགས་པར་བྱེད་པ་ནི་སྒྲ་གཅིག་ལ་སྒྲའི་རྣམ་པར་རིག་པ་དུ་མ་ཉེ་བར་གནས་པའི་ཕྱིར་རོ། །དབང་པོ་ཐམས་ཅད་ཚིམ་པར་བྱེད་པ་ནི་གཅིག་གིས་དོན་དུ་མའི་རྣམ་པར་རིག་པ་ཉེ་བར་གནས་པའི་ཕྱིར་རོ། །མ་སྨད་པ་ནི་དམ་བཅས་པ་བཞིན་དུ་བྱེད་པའི་ཕྱིར་རོ། །མི་འགྱུར་བ་ནི་མ་འོངས་པའི་དུས་ན་རབ་ཏུ་སྦྱོར་བའི་ཕྱིར་རོ། །མ་བརྟབས་པ་ནི་རྟབ་རྟབ་པོར་མི་སྨྲ་བའི་ཕྱིར་རོ། །འཁོར་ཀུན་ཏུ་གྲགས་པ་ནི་འཁོར་ཉེ་རིང་ལ་མཚུངས་པར་གྲགས་པའི་ཕྱིར་རོ།
en: This is the Master’s instruction.

source: །རྣམ་པ་ཐམས་ཅད་ཀྱི་མཆོག་དང་ལྡན་པ་ནི་འཇིག་རྟེན་དོན་དང་། དཔེའི་ཆོས་ཐམས་ཅད་ཀྱི་ཡོངས་སུ་གྲུབ་པའི་ཕྱིར་རོ་ཞེས་སློབ་དཔོན་གྱི་མན་ངག་གོ། །།བམ་པོ་བཅུ་དྲུག་པ། ད་ནི་རབ་འབྱོར་གང་ཡང་ཁྱོད་ཀྱིས་འདི་སྐད་དུ་ཐེག་པ་དེ་ནི་ནམ་མཁའ་དང་མཉམ་པའོ་ཞེས་སྨྲས་པ་ནི་ཞེས་བྱ་བ་ལ་སོགས་པས་ཚིག་གཉིས་པ་བཟུང་སྟེ་བསྟན་ཏོ།
en: Now, with, “Subhūti, you said, ‘The Great Vehicle is equal to space,’ ” and so on, it gives an explanation taking his second statement as its point of departure.

source: །ཀུན་བརྟགས་པའི་དངོས་པོ་རྣམས་ནི་རྣམ་པ་ཉི་ཤུ་རྩ་གཅིག་གིས་རྣམ་པར་གཞག་པ་ཡིན་ཏེ། ཐེག་པ་ཆེན་པོ་འདི་ལ་ནི་རྣམ་པར་གཞག་པ་དེ་དག་མེད་པའི་ཕྱིར་ནམ་མཁའ་དང་མཚུངས་པར་རིག་པར་བྱའོ། །རྣམ་པ་ཉི་ཤུ་རྩ་གཅིག་ནི་ཕྱོགས་རྣམ་པར་གཞག་པ་དང་། དབྱིབས་དང་། ཁ་དོག་དང་། དུས་དང་། འགྲིབ་ཅིང་འཕེལ་བ་ལ་སོགས་པ་དང་། ཀུན་ནས་ཉོན་མོངས་ཤིང་རྣམ་པར་བྱང་བ་དང་། སྐྱེ་ཞིང་འགག་པ་དང་།
en: It should be known as making a presentation of falsely imagined things with twenty-one aspects, and because those that are presented do not exist in this Great Vehicle, it is like space.

source: དགེ་བ་ལ་སོགས་པ་དང་། མཐོང་ཞིང་ཐོས་པ་ལ་སོགས་པ་དང་། ཤེས་པར་བྱ་བ་ལ་སོགས་པ་དང་། རྣམ་པར་སྨིན་ཅིང་རྣམ་པར་སྨིན་པའི་ཆོས་ཅན་དང་། འདོད་ཆགས་ལ་སོགས་པ་དང་། ཁམས་དང་། རབ་ཏུ་དགའ་བ་ལ་སོགས་པ་བྱང་ཆུབ་སེམས་དཔའི་ས་བཅུ་དང་། དཀར་པོ་རྣམ་པར་མཐོང་བ་དང་། རིགས་ཀྱི་ས་ལ་སོགས་པ་ས་བཅུ་དང་། འཕགས་པའི་གང་ཟག་གི་ས་དང་། གཉིས་དང་། ཆོས་ཀྱི་མདོ་དང་། རྣམ་པར་ཐར་པའི་སྒོ་དང་། གསང་བ་དང་། མི་གསང་བ་ལ་སོགས་པ་དང་། རྙེད་པ་ལ་སོགས་པ་དང་། རབ་ཏུ་བརྗོད་པ་ལ་སོགས་པའོ། །དེ་ལ་འགྲིབ་པ་དང་འཕེལ་བ་ནི་རིམ་གྱིས་སོ། །འབྲི་བ་ནི་ཆད་པའོ། །སྐྱེ་བ་ཞེས་བྱ་བ་ནི་དངོས་པོ་རྣམས་ཐོག་མ་སྐྱེ་བའོ།
en: The twenty-one forms presented are (1) direction; (2) shape; (3) color; (4) time; (5) decrease and increase and so on; (6) defilement and purification; (7) produced and stopping, (8) wholesome and so on; (9) seen, heard and so on; (10) something that should be understood and so on; (11) a maturation and subject to maturation; (12) greedy and so on; (13) the constituent, the ten bodhisattva levels, Pramuditā and so on; (14) the ten levels, Śuklavipaśyanā… Gotra and so on; (15) the levels of noble beings; (16) the twos; (17) the Summary of the Doctrine; (18) the doors to liberation; (19) the found and so on; (20) secret and not secret and so on; (21) and discourse and so on.

source: །འགག་པ་ནི་སྐད་ཅིག་གཅིག་ལ་འཇིག་པའོ། །གནས་པ་ནི་དེ་ལྟར་སྐྱེ་ཞིང་འགག་པའི་ཆོས་རྣམས་ཀྱི་རྒྱུན་མ་ཆད་པའོ། །མཐར་ཐུག་པ་ནི་དེའི་རྒྱུན་ཆད་ཅིང་བལྟར་མི་སྣང་བའོ། །གནས་པ་ལས་གཞན་དུ་འགྱུར་བ་ཞེས་བྱ་བ་ནི་དེའི་རྒྱུན་སྔ་མ་དང་། ཕྱི་མ་བྱེ་བྲག་ཅན་དུ་གྱུར་པ་དེ་མི་འདྲ་བར་གྱུར་པའོ།
en: Among these, “decrease [and] increase” are gradual; “reduced” is severed; “produced,” the arising of things at the beginning; “stopping,” perishing in a single instant; “lasting,” phenomena thus produced and stopping not being interrupted; “nonlasting,” interrupted and invisible; and “last and then change into something else,” a continuum with earlier and later specific parts that are dissimilar. “[

source: །ཤེས་པར་བྱ་བ་ཡང་མ་ཡིན་པ་ནི་གཟུགས་ལ་སོགས་པ་ལྟར་ཤེས་པས་རབ་ཏུ་རྟོགས་པར་བྱ་བའི་དངོས་པོ་མེད་པའི་ཕྱིར་རོ།
en: It is] not something that should be understood”— because it is not a thing like form and so on that consciousness can penetrate.

source: །ཀུན་བརྟགས་པའི་ཆོས་ནི་ཤེས་པས་རྟོགས་པར་འགྱུར་བ་མ་ཡིན་ཏེ། དེའི་ཚེ་ན་མེད་པའི་ཕྱིར་རོ།
en: Consciousness cannot penetrate falsely imagined dharmas because in that state they are nonexistent. “[

source: །ཤེས་པར་མི་བྱ་བ་ཡང་མ་ཡིན་ཞེས་བྱ་བ་ནི་རི་བོང་གི་རྭ་ལྟར་ཤིན་ཏུ་མེད་པ་ཡང་མ་ཡིན་པའི་ཕྱིར་རོ། །ཡོངས་སུ་ཤེས་པར་བྱ་བ་ལ་སོགས་པ་ཡང་མ་ཡིན་ཞེས་བྱ་བ་ནི་བདེན་པར་རྟོགས་པ་མ་ཡིན་པའི་ཕྱིར་རོ།
en: It is] not something that should not be understood,” because it is not totally nonexistent like a rabbit’s horns, and “not something that should be thoroughly understood,” and so on, because it is not realized as the truth. “

source: །འབྲས་བུ་གང་ཡིན་པ་ནི་རྣམ་པར་སྨིན་པའོ། །རྣམ་པར་སྨིན་པར་འགྱུར་བ་གང་ཡིན་པ་དེ་ནི་རྣམ་པར་སྨིན་པའི་ཆོས་ཅན་ནོ། །རབ་ཏུ་དགའ་བ་ལ་སོགས་པ་ནི་འཇིག་རྟེན་ལས་འདས་པའི་སེམས་ཀྱི་ངོ་བོ་ཉིད་དུའོ།
en: A maturation” is that which is a result; “subject to maturation” is something that will mature. “[

source: །འཐོབ་པ་མ་ཡིན་ཞེས་བྱ་བ་ནི་རྙེད་པར་བྱ་བ་མ་ཡིན་པའི་ཕྱིར་རོ། །དམིགས་སུ་ཡོད་པ་མ་ཡིན་ཞེས་བྱ་བ་ནི་དབང་པོའི་སྤྱོད་ཡུལ་མ་ཡིན་པའི་ཕྱིར་རོ། །བརྗོད་དུ་ཡོད་པ་མ་ཡིན་པ་ཞེས་བྱ་བ་ནི་ཚིག་གི་ལམ་དུ་མ་གཏོགས་པའི་ཕྱིར་རོ། །བརྗོད་དུ་མེད་པ་ཡང་མ་ཡིན་ནོ་ཞེས་བྱ་བ་ནི་ཀུན་རྫོབ་ཀྱི་ཚིག་གི་ལམ་གྱིས་བསྟན་པར་བྱ་བའི་ཕྱིར་རོ་ཞེས་བྱ་བར་སྦྱར་བར་བྱའོ།
en: It is] not found,” because it is something that is not gained; “not apprehended,” because it is not an object within the range of the faculties; “not discourse,” because you cannot convey it in words; and “not not discourse,” because conventionally you can indicate it with words.

source: །དེའི་འོག་ཏུ།
en: Put them together like that.

source: རབ་འབྱོར་གང་ཡང་ཁྱོད་ཀྱིས་འདི་སྐད་དུ་ཇི་ལྟར་ནམ་མཁའ་སེམས་ཅན་ཚད་མེད་གྲངས་མེད་པའི་གོ་འབྱེད་དོ་ཞེས་སྨྲས་པ་ནི་ཞེས་བྱ་བ་ལ་སོགས་པས་ཚིག་གསུམ་བསྟན་ཏེ།
en: After that there is an explanation of the three statements, with, “Subhūti, where you said, ‘To illustrate, Lord, just as space has room for infinite, countless beings beyond measure,’ ” and so on. “

source: རབ་འབྱོར་སེམས་ཅན་མེད་པའི་ཕྱིར་ནམ་མཁའ་མེད་པར་རིག་པར་བྱའོ། །ནམ་མཁའ་མེད་པའི་ཕྱིར་ཐེག་པ་ཆེན་པོ་མེད་པར་རིག་པར་བྱའོ་ཞེས་བྱ་བའི་དོན་གང་ཡིན་ཞེ་ན།
en: You should know, Subhūti, that because a being is not existent, space is not existent, and you should know that because space is not existent the Great Vehicle is not existent.” What is the meaning of this?

source: གང་ཟག་ལ་བདག་མེད་པས་ཆོས་ལ་བདག་མེད་པ་འཇུག་པར་འགྱུར་བའི་ཕྱིར་སྔར་སེམས་ཅན་མེད་པ་ལ་གནས་ནས་ནམ་མཁའ་མེད་པ་ལ་གནས་པར་འགྱུར་རོ།
en: You should know that you enter into the selflessness of dharmas through the selflessness of persons, so, having earlier been engaged with “beings are nonexistent,” you become engaged with “space is nonexistent.”

source: །ནམ་མཁའ་མེད་པས་ཐེག་པ་ཆེན་པོ་མེད་པ་ལ་གནས་པར་འགྱུར་རོ།
en: You become engaged with “the Great Vehicle is nonexistent” through “space is nonexistent.”

source: །དེ་དག་མེད་པའི་ཕྱིར་དཔག་ཏུ་མེད་པ་ལ་སོགས་པའི་ཆོས་རྣམས་ཀྱང་མེད་པ་ཉིད་དེ་ཆོས་ཐམས་ཅད་ཀྱང་དེ་བཞིན་དུ་རིག་པར་བྱའོ།
en: Because they are nonexistent, the dharmas “infinite” and so on are nonexistent too, and similarly with all dharmas. “

source: །སེམས་ཅན་མེད་པའི་ཕྱིར་དེ་བཞིན་ཉིད་མེད་པར་རིག་པར་བྱའོ་ཞེས་བྱ་བ་ནི་སེམས་ཅན་མེད་པས་ཀུན་བརྟགས་པའི་གཟུགས་ཀྱི་དེ་བཞིན་ཉིད་དང་། སྒྲའི་དེ་བཞིན་ཉིད་ལ་སོགས་པ་མེད་པར་རིག་པར་བྱའོ།
en: Suchness is nonexistent because beings are nonexistent.” It should be understood that because “beings are nonexistent,” the falsely imagined suchness of form and suchness of sound and so on are nonexistent.

source: །དེ་ལྟར་ཆོས་ཐམས་ཅད་མེད་པའི་ཕྱིར་ནམ་མཁའ་དང་མཚུངས་པས་གོ་སྐབས་འབྱེད་དོ་ཞེས་བྱ་བར་དགོངས་པའོ།
en: Thus, the intention is this: because “all dharmas are nonexistent,” therefore it is “like space,” and therefore it “has room.”

source: །མེད་པ་ཉིད་ཀྱི་ཕྱིར་དཔག་ཏུ་མེད་པ་ལ་སོགས་པར་འགྱུར་རོ།
en: Because it is “nonexistent,” it is “infinite” and so on.

source: །འགྲེས་འདི་ལ་ཉི་ཤུ་རྩ་དྲུག་སྟེ་སེམས་ཅན་མེད་པའི་ཕྱིར་ནམ་མཁའ་མེད་དོ། །ནམ་མཁའ་མེད་པའི་ཕྱིར་ཐེག་པ་ཆེན་པོ་མེད་དོ་ཞེས་བྱ་བ་ནི་འགྲེས་དང་པོའོ།
en: In this subsection of the text, the first subsection of that is “because a being is not existent, space is not existent… because space is not existent the Great Vehicle is not existent.”

source: །གསུམ་པོ་དེ་དག་ཉིད་དཔག་ཏུ་མེད་པ་དང་སྦྱར་བ་ནི་གཉིས་པའོ། །གྲངས་མེད་པ་དང་སྦྱར་བ་ནི་གསུམ་པའོ། །ཚད་མེད་པ་དང་སྦྱར་བ་ནི་བཞི་པའོ།
en: The second has those same three connected with “infinite,” the third connected with “countless,” and the fourth connected with “beyond measure.”

source: །ཆོས་ཀྱི་དབྱིངས་དང་སྦྱར་བ་ནི་ལྔ་པའོ། །དེ་བཞིན་ཉིད་དང་སྦྱར་བ་ནི་དྲུག་པའོ།
en: The fifth has them connected with “the dharma-constituent,” and the sixth connected with “suchness.”

source: །སེམས་ཅན་དང་སྲོག་ལ་སོགས་པ་བཅུ་གསུམ་གྱིས་བསྣན་ཏེ། ཐ་མ་ཡང་དག་པའི་མཐའ་དང་སྦྱར་བ་ནི་བདུན་པའོ། །དེ་ཉིད་ལ་ཡང་དག་པའི་མཐའ་བཀོལ་ཏེ།
en: In the seventh, having added on the thirteen— “self, a living being,” and so on—they are connected with the last one, “the very limit of reality.”

source: བསམ་གྱིས་མི་ཁྱབ་པའི་དབྱིངས་དང་སྦྱར་བ་ནི་བརྒྱད་པའོ། །དེ་དག་ཉིད་གཟུགས་ལ་སོགས་པའི་ཕུང་པོའི་ཆོས་དང་སྦྱར་བ་ནི་དགུ་པའོ། །དེ་དག་ཉིད་ནང་གི་སྐྱེ་མཆེད་དྲུག་དང་སྦྱར་བ་ནི་བཅུ་པའོ། །ཕྱི་རོལ་གྱི་དྲུག་དང་སྦྱར་བ་ནི་བཅུ་གཅིག་པའོ། །རྣམ་པར་ཤེས་པ་དྲུག་དང་སྦྱར་བ་ནི་བཅུ་གཉིས་པའོ། །རེག་པ་དྲུག་དང་སྦྱར་བ་ནི་བཅུ་གསུམ་པའོ། །ཚོར་བའི་ཚོགས་དྲུག་དང་སྦྱར་བ་ནི་བཅུ་བཞི་པའོ།
en: The eighth has just those connected with “the inconceivable element,” serving for the very limit of reality.

source: །ཁམས་དྲུག་དང་སྦྱར་བ་ནི་བཅོ་ལྔ་པའོ། །རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་དང་སྦྱར་བ་ནི་བཅུ་དྲུག་པའོ། །ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་དང་སྦྱར་བ་ནི་བཅུ་བདུན་པའོ། །སྟོང་པ་ཉིད་ཐམས་ཅད་དང་སྦྱར་བ་ནི་བཅོ་བརྒྱད་པའོ། །བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་དང་སྦྱར་བ་ནི་བཅུ་དགུ་པའོ། །འཕགས་པའི་བདེན་པ་ནས་གཟུངས་ཀྱི་སྒོའི་བར་དང་སྦྱར་བ་ནི་ཉི་ཤུ་པའོ། །སྟོབས་བཅུ་ནས། མ་འདྲེས་པའི་བར་དང་སྦྱར་བ་ནི་ཉི་ཤུ་གཅིག་པའོ། །རིགས་ཀྱི་སའི་ཆོས་ནས་བྱས་པ་རྟོགས་པའི་བར་དང་སྦྱར་བ་ནི་ཉི་ཤུ་གཉིས་པའོ། །རྒྱུན་དུ་ཞུགས་པ་ནས་དགྲ་བཅོམ་པའི་བར་གྱི་གང་ཟག་དང་སྦྱར་བ་ནི་ཉི་ཤུ་གསུམ་པའོ། །རང་སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་དང་སངས་རྒྱས་དང་སྦྱར་བ་ནི་ཉི་ཤུ་བཞི་པའོ།
en: The ninth has just those connected with dharmas—the “form” aggregate and so on; the tenth has just those connected with the six inner sense fields; the eleventh connected with the six outer ones; the twelfth connected with the six “consciousnesses”; the thirteenth connected with the six “contacts”; the fourteenth connected with the six collections of “feelings”; the fifteenth connected with the six “elements”; the sixteenth connected with “dependent origination”; the seventeenth connected with the six “perfections”; the eighteenth connected with all “the emptinesses”; the nineteenth connected with the thirty-seven dharmas on the side of awakening; the twentieth connected with “the noble truths,” up to “the dhāraṇī doors”; the twenty-first connected with “the ten powers,” up to “the distinct attributes of a buddha”; the twenty-second connected with “the Gotra level,” up to “the Kṛtāvin level”; the twenty-third connected with persons, from “stream enterer” up to “worthy one”; the twenty-fourth connected with “pratyekabuddhas, bodhisattvas, and buddhas”; the twenty-fifth connected with the three “vehicles”; and the twenty-sixth subsection of the passage teaching with an analogy connected with “nirvāṇa.”

source: །ཐེག་པ་གསུམ་དང་སྦྱར་བ་ནི་ཉི་ཤུ་ལྔ་པའོ། །མྱ་ངན་ལས་འདས་པའི་དཔེ་བསྟན་པ་ནི་འགྲེས་ཉི་ཤུ་རྩ་དྲུག་པ་སྟེ། དེ་དག་ནི་འགྲེས་ཉི་ཤུ་རྩ་དྲུག་གོ།
en: These are the twenty-six subsections of the passage. “

source: །ཐེག་པ་འདི་ལ་འོང་བའམ། འགྲོ་བ་ཞེས་བྱ་བ་ཡང་མི་དམིགས་ཤིང་གནས་པ་ཞེས་བྱ་བ་ཡང་མེད་དོ་ཞེས་བྱ་བ་ལ་སོགས་པས་ཚིག་བཞི་པ་བསྟན་ཏེ།
en: In this vehicle you cannot apprehend ‘coming or going,’ and there is not even ‘remaining,’ and so on, teaches the fourth statement. “

source: རབ་འབྱོར་ཆོས་ཐམས་ཅད་ནི་དབྱེ་བ་མེད་པ་སྟེ།
en: Subhūti, all dharmas are unmoving.

source: དེ་དག་གང་དུ་ཡང་འདོར་བ་མེད་དོ། །གང་ནས་ཀྱང་འོང་བ་མེད་དོ། །གར་ཡང་གནས་པ་མེད་དོ་ཞེས་བྱ་བ་ནི་མཐར་ཐུག་པའི་ཐེག་པ་ཆེན་པོའི་གནས་སྐབས་ན་ཆོས་ཐམས་ཅད་དེ་བཞིན་ཉིད་ཙམ་དུ་ཟད་པའི་ཕྱིར།
en: They do not go anywhere, they do not come from anywhere, and they do not remain anywhere,” because in the context of the final vehicle they are simply just suchness.

source: སྐྱེ་བ་དང་། འགག་པ་དང་། གནས་པ་མེད་པས་མི་གཡོ་བར་སྣང་ངོ་།
en: They appear unmoving because they do not arise, stop, or remain. “

source: །རང་བཞིན་དང་དེ་བཞིན་ཉིད་དང་ངོ་བོ་ཉིད་དང་ཞེས་བྱ་བ་ནི་མཐར་ཐུག་པའི་ཐེག་པ་ཆེན་པོའི་ས་ལ་ཆོས་ཀྱི་དབྱིངས་དེ་ཉིད་རང་བཞིན་ཉིད་དང་། དེ་བཞིན་ཉིད་དང་། ངོ་བོ་ཉིད་དང་། མཚན་ཉིད་ཁོ་ནར་བཟུང་སྟེ། དེ་ཉིད་རང་བཞིན་ཡིན་གྱི་གཞན་མེད་དོ། །དེ་ཉིད་དེ་བཞིན་ཉིད་ཡིན་གྱི་གཞན་མ་ཡིན་ནོ། །དེ་ཉིད་ངོ་བོ་ཉིད་ཡིན་གྱི་གཞན་མ་ཡིན་ནོ།
en: Basic nature… suchness… intrinsic nature”— take that dharma-constituent itself, in the context of the final Great Vehicle level, as just “basic nature, suchness, intrinsic nature,” and “mark,” because just that is the basic nature, not something else; just that is suchness, not something else; just that is intrinsic nature, not something else; and just that is the mark, not something else.

source: །དེ་ཉིད་མཚན་ཉིད་ཡིན་གྱི་གཞན་མ་ཡིན་ཏེ། དེ་ལས་ཕྱེ་སྟེ་སྨོས་པ་ཙམ་དུ་ཟད་དོ།
en: It is simply just described differently from it.

source: །དེ་ལ་མི་གཡོ་བའི་འགྲེས་ནི་དང་པོའོ། །དེ་ནས་ཕུང་པོ་རྣམས་དང་། སྐྱེ་མཆེད་རྣམས་དང་། རྣམ་པར་ཤེས་པ་རྣམས་དང་། རེག་པ་རྣམས་དང་།
en: There, the “unmoving” subsection is the first.

source: ཚོར་བ་རྣམས་དང་། ཁམས་དྲུག་དང་། རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བའི་ཡན་ལག་རྣམས་དང་། ཕ་རོལ་ཏུ་ཕྱིན་པ་རྣམས་དང་། སྟོང་པ་ཉིད་ཐམས་ཅད་དང་། དྲན་པ་ཉེ་བར་གཞག་པ་ལ་སོགས་པ་མ་འདྲེས་པའི་མཐར་ཐུག་པ་རྣམས་དང་། དེ་བཞིན་ཉིད་དང་། མ་ནོར་བ་དེ་བཞིན་ཉིད་དང་། གཞན་མ་ཡིན་པ་དེ་བཞིན་ཉིད་དང་། ཆོས་ཉིད་དང་། ཆོས་ཀྱི་དབྱིངས་དང་། ཆོས་གནས་པ་ཉིད་དང་། ཆོས་སྐྱོན་མེད་པ་ཉིད་དང་། ཡང་དག་པའི་མཐའ་དང་། བསམ་གྱིས་མི་ཁྱབ་པའི་དབྱིངས་དང་། བྱང་ཆུབ་དང་། སངས་རྒྱས་དང་། འདུས་བྱས་དང་།
en: Then you should connect those with the aggregates, sense fields, consciousnesses, contacts, feelings, six elements, links of dependent origination, perfections, and emptinesses; the applications of mindfulness up to the distinct attributes of a buddha; and suchness, unmistaken suchness, unaltered suchness, the true nature of dharmas, the dharma-constituent, the establishment of dharmas, the certification of dharmas, the very limit of reality, the inconceivable element, awakening, buddha, the compounded, and the uncompounded.

source: འདུས་མ་བྱས་རྣམས་ཏེ། དེ་དག་དང་སྦྱར་བར་བྱའོ། །དེའི་འོག་ཏུ་ཐེག་པ་དེ་ལ་སྔོན་གྱི་མཐའ་ཡང་མི་དམིགས། ཕྱི་མའི་མཐའ་ཡང་མི་དམིགས། དབུས་ཀྱང་མི་དམིགས་ཏེ།
en: After that, in the statement, “You cannot apprehend that vehicle’s prior limit, cannot apprehend its later limit, and cannot apprehend its middle either.

source: དེ་ནི་དུས་གསུམ་མཉམ་པ་ཉིད་ཀྱི་ཐེག་པ་སྟེ།
en: This is a vehicle equally of the three time periods.
